using Alias.Network;
using Alias.Network;

class Program
{
    static void Main()
    {
        List<string> words = new List<string>
        {
            "Яблоко", "Пианино", "Портфель", "Камера", "Парашют", "Ангел", "Орех", "Велосипед",
            "Космонавт", "Треугольник", "Чайник", "Дельфин", "Микроскоп", "Лаваш", "Водопад",
            "Чемодан", "Спагетти", "Карусель", "Фонарик", "Пингвин", "Лимонад", "Алмаз",
            "Квадрат", "Шахматы", "Акула", "Косметика", "Шашлык", "Ракета", "Карнавал",
            "Фартук", "Яичница", "Телевизор", "Девочка", "Тележка", "Кокос", "Полет",
            "Карусель", "Молния", "Дракон", "Самолет", "Фламинго", "Лавина", "Футболка",
            "Скакалка", "Леденец", "Гитара", "Мухобойка", "Секрет", "Кремль", "Компас"
        };
        var server = new GameServer("127.0.0.1", 12345, words);
        server.Start();
        Console.ReadLine();
    }
}